#!/bin/bash

# Функція для пошуку файлу за іменем у вказаному каталозі та його підкаталогах
find_file() {
    # Перевірка, чи вказано ім'я файлу
    if [ -z "$1" ]; then
        echo "Вкажіть ім'я файлу для пошуку"
        return 1
    fi

    # Перевірка, чи вказано каталог для пошуку
    if [ -z "$2" ]; then
        echo "Вкажіть каталог для пошуку"
        return 1
    fi

    # Пошук файлу за вказаним іменем у вказаному каталозі та його підкаталогах
    find "$2" -type f -name "$1"
}

# Виклик функції
find_file "example.txt" "/path/to/directory"
